In [1]:
import pandas as pd

In [2]:
import numpy as np

In [7]:
import csv

In [13]:
#load CSV files
schools_csv = 'Resources/schools_complete.csv'
students_csv = 'Resources/students_complete.csv'

In [15]:
#read csv files as new DataFrame
schools_df = pd.read_csv(schools_csv)
students_df = pd.read_csv(students_csv)

In [27]:
schools_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [45]:
#Combine the data into a single dataset
combined_dataset = pd.merge(students_df, schools_df, how="left", on=["school_name", "school_name"])
combined_dataset.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [48]:
#Rename Column Names for Schools
schools_and_students= combined_dataset.rename(columns={'school_name':'School_Name', 'type':'School_Type', 'size':'School_Size', 'budget':'Budget','student_name':'Student_Name', 'gender':'Gender','grade':'Grade', 'school_name':'School_Name', 'reading_score':'Reading_Score','math_score':'Math_Score'})
schools_and_students.head()

,Student ID,Student_Name,Gender,Grade,School_Name,Reading_Score,Math_Score,School ID,School_Type,School_Size,Budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

# District Summary

In [55]:
#Calculate the total number of schools
schools_total = schools_and_students.School_Name.nunique()
print(schools_total)
type(schools_total)

15

int

In [ ]:
#Calculate the total number of students
students_total =

In [ ]:
#Calculate the total budget
budget_total =

In [ ]:
#Calculate the average math score
math_score_avg =

In [ ]:
#Calculate the average reading score
reading_score_avg =

In [ ]:
#Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2
overall_passing_rate =

In [ ]:
#Calculate the percentage of students with a passing math score (70 or greater)
percent_passing_math_score =

In [ ]:
#Calculate the percentage of students with a passing reading score (70 or greater)
percent_passing_math_score =

In [ ]:
#Create a dataframe to hold the above results
dataframe_results